package main

import "fmt"

func main() {
	fmt.Println("数据类型")
	// 有符号整数类型
	// 有符号整数类型二进制首位0/1表示正负数
	// 二进制 127 -> 01111111
	// 二进制 -128 ->  10000000
	// 127是怎么推算的
	// 01111111 -> 二进制 -> 十进制：
	//  1*2^6  +  1*2^5  +  1*2^4  +  1*2^3  +  1*2^2  +  1*2^1  +  1*2^0
	// =  64   +    32   +    16   +    8    +    4    +    2    +    1
	// =  127

	// int8 1字节 -2^7~2^7-1 -128~127
	var n1 int8 = 127
	fmt.Println(n1)
	// int16 2字节 -32768~32767
	var n2 int16 = 32767
	fmt.Println(n2)
	// int32 4字节 -2147483648~2147483647
	var n3 int32 = 2147483647
	fmt.Println(n3)
	// int64 8字节 -2^63~2^63-1

	// 无符号整数类型
	// 和有符号整数类型用前面的u区分

}
